Tekla Open API Reference for Tekla Structures 2025
ControlPlane Constructor
 Creates a new control plane instance.
The default values are as follows:
Plane = new Plane();
IsMagnetic = false;
Name = "Plane";
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ControlPlane()
Public Sub New
See Also
Reference
ControlPlane Class
ControlPlane Overload
Tekla.Structures.Model Namespace